/**
 * 記錄錯誤代碼 + 錯誤訊息
 * Key值代表錯誤代號，value表示錯誤訊息
 *
 */
var ErrorCode = {
    00000: '(00000)',
    10001: '使用者帳號不可為空(10001)',
    10002: '使用者帳號不符合格式[僅能輸入：英文、數字、下底線](10002)',
    10003: '使用者密碼不可為空(10003)',
    10004: '使用者密碼不符合格式[僅能輸入：英文、數字、下底線](10004)',
    10005: '註冊會員失敗(10005)',
    10006: '該會員已存在，不可重複註冊(10006)',
    10007: '取會員清單失敗(10007)',
    10008: '該系統尚無會員註冊(10008)',
    10009: '請填寫新暱稱(10009)',
    10010: '修改暱稱失敗(10010)',
    10011: '取用戶資料失敗(10011)',
    10012: '取會員詳細資料失敗(10012)',
    10013: '(10013)',
    10014: '(10014)',
}

module.exports = ErrorCode;